tap "adoptopenjdk/openjdk"
tap "bufbuild/buf"
tap "epk/epk"
tap "felixkratz/formulae"
tap "fluttergen/tap"
tap "grishka/grishka"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "thezoraiz/ascii-image-converter"
brew "coreutils"
brew "asdf"
brew "awk"
brew "node"
brew "bash-language-server"
brew "bat"
brew "boxes"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "cowsay"
brew "cpanminus"
brew "entr"
brew "exa"
brew "fd"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "geckodriver"
brew "git"
brew "git-lfs"
brew "gitmoji"
brew "gitui"
brew "gnu-typist"
brew "openldap"
brew "gnupg"
brew "gum"
brew "helix"
brew "hyperfine"
brew "libimobiledevice"
brew "ideviceinstaller"
brew "jp2a"
brew "jq"
brew "lazygit"
brew "lcov"
brew "lf"
brew "llvm"
brew "lolcat"
brew "marksman"
brew "mas"
brew "ncdu"
brew "neofetch"
brew "nghttp2"
brew "pandoc"
brew "pass"
brew "pillow"
brew "protobuf"
brew "pv"
brew "python-lsp-server"
brew "python@3.10"
brew "python@3.9"
brew "ripgrep"
brew "rmlint"
brew "shellcheck"
brew "sk"
brew "slides"
brew "socat"
brew "starship"
brew "swift-format"
brew "swiftlint"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash-cli"
brew "universal-ctags"
brew "unzip"
brew "youtube-dl"
brew "z"
brew "zoxide"
brew "zsh"
brew "bufbuild/buf/buf"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "adoptopenjdk8"
cask "alacritty"
cask "cheatsheet"
cask "discord", args: { appdir: "~/Applications" }
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font"
cask "google-cloud-sdk"
cask "karabiner-elements"
cask "keka"
cask "mactex-no-gui"
cask "neardrop"
cask "onyx"
cask "openinterminal"
cask "raycast"
cask "visual-studio-code"
cask "xquartz"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
vscode "1YiB.rust-bundle"
vscode "9beach.vscode-hanspell"
vscode "aaron-bond.better-comments"
vscode "albert.TabOut"
vscode "alefragnani.project-manager"
vscode "alexisvt.flutter-snippets"
vscode "BendixMa.dart-data-class-generator"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "cab404.vscode-direnv"
vscode "cesium.gltf-vscode"
vscode "christian-kohler.path-intellisense"
vscode "chunsen.bracket-select"
vscode "circlecodesolution.ccs-flutter-color"
vscode "circledev.glsl-canvas"
vscode "cloudedcat.vscode-model-viewer"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "felipecaputo.git-project-manager"
vscode "flutterando.flutter-coverage"
vscode "formulahendry.code-runner"
vscode "FushiArt.copywidget"
vscode "gera2ld.markmap-vscode"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "Google.arb-editor"
vscode "Gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "humao.rest-client"
vscode "hzgood.dart-data-class-generator"
vscode "jevakallio.vscode-live-frame"
vscode "jflbr.jwt-decoder"
vscode "localizely.flutter-intl"
vscode "luanpotter.dart-import"
vscode "LuisAlvesMartins.markdown-code-to-png"
vscode "mathiasfrohlich.Kotlin"
vscode "mhutchie.git-graph"
vscode "miquelddg.dart-barrel-file-generator"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ko"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "Nash.awesome-flutter-snippets"
vscode "oderwat.indent-rainbow"
vscode "patbenatar.advanced-new-file"
vscode "PeterHdd.dartgettersetter"
vscode "PeterSchmalfeldt.explorer-exclude"
vscode "pflannery.vscode-versionlens"
vscode "Phu1237.vs-browser"
vscode "PKief.material-icon-theme"
vscode "raczzalan.webgl-glsl-editor"
vscode "redhat.vscode-yaml"
vscode "ricardo-emerson.dart-data-class-tools"
vscode "ricardo-emerson.flutter-development-extensions-pack"
vscode "ricardo-emerson.flutter-print"
vscode "ritwickdey.LiveServer"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "ronba.vscode-rive-viewer"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "seatonjiang.gitmoji-vscode"
vscode "serayuzgur.crates"
vscode "SergeLamikhov.lcov-lang"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "silverquark.dancehelix"
vscode "sswg.swift-lang"
vscode "stevejpurves.cucumber"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-apple-swift-format"
vscode "vknabel.vscode-swiftlint"
vscode "vstirbu.vscode-mermaid-preview"
vscode "ybaumes.highlight-trailing-white-spaces"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
