tap "adoptopenjdk/openjdk"
tap "epk/epk"
tap "felixkratz/formulae"
tap "fluttergen/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "coreutils"
brew "asdf"
brew "bat"
brew "ruby"
brew "cocoapods"
brew "openldap"
brew "curl"
brew "direnv"
brew "dolt"
brew "entr"
brew "exa"
brew "fasd"
brew "fd"
brew "fzf"
brew "geckodriver"
brew "git"
brew "git-lfs"
brew "gnu-typist"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "helix"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "lcov"
brew "lf"
brew "llvm"
brew "mas"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "protobuf"
brew "ripgrep"
brew "rmlint"
brew "shellcheck"
brew "sk"
brew "starship"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash-cli"
brew "universal-ctags"
brew "unzip"
brew "z"
brew "zoxide"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "qmk/qmk/qmk"
cask "adoptopenjdk8"
cask "alacritty"
cask "alt-tab"
cask "betterdisplay"
cask "calibre"
cask "cheatsheet"
cask "discord", args: { appdir: "~/Applications" }
cask "eul"
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font"
cask "keka"
cask "notion"
cask "obsidian"
cask "onyx"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "zeplin"
mas "AdBlock Pro", id: 1018301773
mas "Color Picker", id: 1545870783
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
